Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: Value 0, `LV_OPA_0` or `LV_OPA_TRANSP` means fully transparent, 255, `LV_OPA_100` or `LV_OPA_COVER` means fully covering, other values or LV_OPA_10, LV_OPA_20, etc means semi transparency.
it_it: Il valore 0, `LV_OPA_0` o `LV_OPA_TRANSP` significa completamente trasparente, 255, `LV_OPA_100` o `LV_OPA_COVER` significa completamente coprente, altri valori o LV_OPA_10, LV_OPA_20, ecc. indicano semi-trasparenza.

source: Value 0, `LV_OPA_0` or `LV_OPA_TRANSP` means fully transparent.
it_it: Il valore 0, `LV_OPA_0` o `LV_OPA_TRANSP` significa completamente trasparente.

source: Value 0, `LV_OPA_0` or `LV_OPA_TRANSP` means no mixing, 255, `LV_OPA_100` or `LV_OPA_COVER` means full recoloring, other values or LV_OPA_10, LV_OPA_20, etc are interpreted proportionally.
it_it: Il valore 0, `LV_OPA_0` o `LV_OPA_TRANSP` significa nessuna miscelazione, 255, `LV_OPA_100` o `LV_OPA_COVER` significa ricolorazione completa, altri valori o LV_OPA_10, LV_OPA_20, ecc. vengono interpretati proporzionalmente.

source: Value Modification
it_it: Modifica del Valore

source: Value and range
it_it: Valore e intervallo

source: Value must be multiple of stride alignment in px.
it_it: Il valore deve essere un multiplo dell'allineamento "stride"' in px.

source: Value of Images
it_it: Valore delle Immagini

source: Value, range and orientation
it_it: Valore, intervallo e orientamento

source: Value, range and step
it_it: Valore, intervallo e passo

source: Values can be selectively overridden.
it_it: I valori possono essere sovrascritti selettivamente.

source: Values greater than 1000 speed up animations (e.g., 2000 = 2.0x speed)
it_it: Valori superiori a 1000 accelerano le animazioni (ad esempio, 2000 = 2.0x speed)

source: Values less than 1000 slow down animations (e.g., 500 = 0.5x speed)
it_it: Valori inferiori a 1000 rallentano le animazioni (ad esempio, 500 = 0,5x speed)

source: Values like ``LV_OPA_TRANSP``, ``LV_OPA_10``, etc., can also be used.
it_it: È possibile utilizzare anche valori come ``LV_OPA_TRANSP``, ``LV_OPA_10``, ecc.

source: Variable/Option
it_it: Variabile/Opzione

source: Variables
it_it: Variabili

source: Variables in a file (outside functions) are always *static*.
it_it: Le variabili in un file (al di fuori delle funzioni) sono sempre *static*.

source: Variables:
it_it: Variabili:

source: Variables_
it_it: Variabili_

source: Various discussions: `here <https://github.com/lvgl/lvgl/pull/3294#issuecomment-1184895335>`__ and `here <https://github.com/lvgl/lvgl/issues/1763#issuecomment-762247629>`__ and `here <https://github.com/lvgl/lvgl/issues/316#issuecomment-467221587>`__
it_it: Varie discussioni: `qui <https://github.com/lvgl/lvgl/pull/3294#issuecomment-1184895335>`__, `qui <https://github.com/lvgl/lvgl/issues/1763#issuecomment-762247629>`__ e `qui <https://github.com/lvgl/lvgl/issues/316#issuecomment-467221587>`__

source: Various input devices such as touchpad, mouse, keyboard, encoder, etc.
it_it: Vari dispositivi di input come touchpad, mouse, tastiera, encoder, ecc.

source: Various subsystems of LVGL can be enabled or disabled by setting a macro in ``lv_conf.h`` to 1 or 0 respectively.
it_it: Vari sottosistemi di LVGL possono essere abilitati o disabilitati impostando una macro in ``lv_conf.h`` rispettivamente su 1 o 0.

source: Vector Draw Descriptor
it_it: Descrittore di Disegno Vettoriale

source: Vector Graphics
it_it: Grafica Vettoriale

source: Verdin Carrier Boards:
it_it: Schede Carrier Verdin:

source: Verdin Computer on Module:
it_it: Computer on Module Verdin:

source: Verdin is a System on Module standard expanding on the successful Colibri and Apalis form factors.
it_it: Verdin è uno standard System on Module che amplia i fattori di forma di successo Colibri e Apalis.

source: Verdin is similar sized to the Colibri but with a higher pin count.
it_it: Verdin ha dimensioni simili a Colibri, ma con un numero di pin maggiore.

source: Verify that the output executable was compiled with the correct toolchain:
it_it: Verificare che l'eseguibile di output sia stato compilato con la toolchain corretta:

source: Version
it_it: Versione

source: Version support
it_it: Versioni supportate

source: Versions supported: LVGL v8.0.2, LodePNG v20201017, Freetype 2.10.4
it_it: Versioni supportate: LVGL v8.0.2, LodePNG v20201017, Freetype 2.10.4

source: Vertical
it_it: Verticale

source: Vertical offset.
it_it: Offset verticale.

source: Vertical range
it_it: Range verticale

source: Vertical skew, similar to ``skew_x``.
it_it: Inclinazione verticale, simile a ``skew_x``.

source: Vertical text offset.
it_it: Offset verticale del testo.

source: Very long or very wide tables can be difficult to read and use.
it_it: Tabelle molto lunghe o molto larghe possono essere difficili da leggere e utilizzare.

source: Very long text
it_it: Testo molto lungo

source: Very similar to Label-text binding, a Span's text can be bound to a subject as well.
it_it: Molto simile al binding Label-text, anche il testo di uno Span può essere associato a un oggetto.

source: Very similar to the margin properties in HTML.
it_it: Molto simile alle proprietà margin in HTML.

source: Very similar to the padding properties in HTML.
it_it: Molto simile alle proprietà di padding in HTML.

source: Via
it_it: Tramite

source: Video Support
it_it: Supporto Video

source: Video frames are rendered as image content that updates automatically during playback
it_it: I "frame" [fotogrammi] video vengono renderizzati come contenuto immagine che si aggiorna automaticamente durante la riproduzione.

source: Video handling and processing utilities
it_it: Utility di gestione ed elaborazione video

source: Video resolution via ``lv_image_get_src_width()`` and ``lv_image_get_src_height()``
it_it: Risoluzione video tramite ``lv_image_get_src_width()`` e ``lv_image_get_src_height()``

source: Video4Linux2 (V4L2) camera devices on Linux
it_it: Dispositivi videocamera Video4Linux2 (V4L2) su Linux

source: View the .rst source file that generated that page by clicking the "eye" icon at the top of the page.
it_it: Visualizzare il file sorgente .rst che ha generato quella pagina cliccando sull'icona a forma di "occhio" in cima alla pagina.

source: Viewe not only offers one-stop `bare display and touch solutions <https://viewedisplay.com/display-solutions/>`_ but also `embedded smart displays <https://viewedisplay.com/smart-solutions/>`_ with standard productions and tailored customization to develop your concepts to reality.
it_it: Viewe non offre solo `soluzioni complete per display e touch <https://viewedisplay.com/display-solutions/>`_ ma anche `display intelligenti embedded <https://viewedisplay.com/smart-solutions/>`_ con produzioni standard e personalizzate per trasformare i vostri progetti in realtà.

source: Virtualization support (as host and guest)
it_it: Supporto per la virtualizzazione (come host e guest)

source: Visible rows
it_it: Righe visibili

source: Visit `My Website <https://pro.lvgl.io>`__.
it_it: Visitare `Il Mio Sito Web <https://pro.lvgl.io>`__.

source: Visual Settings
it_it: Impostazioni Visive

source: Visual settings adjustment
it_it: Regolazione delle impostazioni visive

source: Volume Control
it_it: Controllo del Volume

source: Volume control with 0-100% range
it_it: Controllo del volume con intervallo 0-100%

source: WIN32 (Windows using Win32 API function .e.g ``CreateFileA``, ``ReadFile``)
it_it: WIN32 (Windows che utilizza le funzioni API Win32, ad esempio ``CreateFileA``, ``ReadFile``)

source: Wait briefly for the workspace to launch.
it_it: Attendere brevemente l'avvio dell'area di lavoro.

source: Wait for it to complete.
it_it: Attendere il completamento.

source: Wayland Display/Inputs driver
it_it: Driver per Display/Input Wayland

source: Wayland, DRM, SDL, and fbdev display drivers
it_it: Driver di visualizzazione Wayland, DRM, SDL e fbdev

source: Ways to Contribute
it_it: Modi per Contribuire

source: We apply 2 patches to modify the ``CMakeLists.txt`` and ``lv_conf.h``.
it_it: Applichiamo 2 patch per modificare ``CMakeLists.txt`` e ``lv_conf.h``.

source: We are using GitHub labels to show the state and attributes of the issues and Pull requests.
it_it: Utilizziamo le etichette GitHub per mostrare lo stato e gli attributi delle problematiche e delle Pull Request.

source: We cannot use :ref:`indev event mode` because :cpp:func:`lv_indev_read` should not be called in an interrupt handler.
it_it: Non possiamo usare :ref:`indev event mode` perché :cpp:func:`lv_indev_read` non dovrebbe essere chiamato in un interrupt handler.

source: We handle the compilation in a container using `Podman <https://podman.io/>`__ (similar to Docker).
it_it: Gestiamo la compilazione in un container usando `Podman <https://podman.io/>`__ (simile a Docker).

source: We have prepared several tutorials in https://github.com/lvgl/lvgl_editor/tree/master/tutorials\ .
it_it: Abbiamo preparato diversi tutorial su https://github.com/lvgl/lvgl_editor/tree/master/tutorials\ .

source: We use `GitHub issues <https://github.com/lvgl/lvgl/issues>`_ for development related discussion.
it_it: Utilizziamo `GitHub issues <https://github.com/lvgl/lvgl/issues>`_ per le discussioni relative allo sviluppo.

source: We used existing recipes.
it_it: Abbiamo utilizzato ricette esistenti.

source: We will focus on 1 application that will clone an lvgl git repository and patch it for our needs.
it_it: Ci concentreremo su un'applicazione che clonerà un repository git lvgl e vi applicherà le patch per le nostre esigenze.

source: WebP Decoder
it_it: Decoder WebP

source: WebP image format support for textures (https://github.com/webmproject/libwebp)
it_it: Supporto del formato immagine WebP per le texture (https://github.com/webmproject/libwebp)

source: WebP offers:
it_it: WebP offre:

source: Welcome to LVGL Docs
it_it: Benvenuti nella Documentazione di LVGL

source: What Does It Look Like?
it_it: Come si Presenta?

source: What areas of the display have been updated (made "dirty") so rendering logic can compute what to render during a display refresh
it_it: Quali aree del display sono state aggiornate (rese "sporche") in modo che la logica di rendering possa calcolare cosa visualizzare durante un aggiornamento del display

source: What does it look like?
it_it: Che aspetto ha?

source: What does the "best matching state's property" mean?
it_it: Cosa significa "proprietà dello stato più corrispondente"?

source: What happened?
it_it: Cosa è successo?

source: What happens next is up to the application designer.
it_it: Ciò che accade dopo è a discrezione del progettista dell'applicazione.

source: What have I missed?
it_it: Cos'è sfuggito?

source: What is Berry?
it_it: Cos'è Berry?

source: What is DMA2D
it_it: Cos'è DMA2D?

source: What is Drawing?
it_it: Cos'è il Disegno?

source: What is MicroPython?
it_it: Cos'è MicroPython?

source: What is NuttX?
it_it: Cos'è NuttX?

source: What is PikaScript?
it_it: Cos'è PikaScript?

source: What is QNX?
it_it: Cos'è QNX?

source: What is RT-Thread?
it_it: Cos'è RT-Thread?

source: What is Tasmota?
it_it: Cos'è Tasmota?

source: What is Zephyr?
it_it: Cos'è Zephyr?

source: What is a Display?
it_it: Cos'è un Display?

source: What is a Font?
it_it: Cos'è un Font?

source: What is a Widget Property?
it_it: Cos'è una Proprietà di un Widget?

source: What is an Image Decoder?
it_it: Cos'è un Decoder di Immagini?

source: What is an Image?
it_it: Cos'è un'immagine?

source: What is an indev?
it_it: Cos'è un indev?

source: What is being measured (current or voltage)?
it_it: Cosa viene misurato (corrente o tensione)?

source: What is different is that updates to the Widget's property thus bound are handled internally -- the user *does not supply callback functions* for any of these subscribing methods -- the callback methods are supplied by the Observer subsystem.
it_it: La differenza è che gli aggiornamenti alla proprietà del Widget così associato vengono gestiti internamente: l'utente *non fornisce funzioni di callback* per nessuno di questi metodi di sottoscrizione; i metodi di callback sono forniti dal sottosistema di Observer.

source: What is glTF?
it_it: Cos'è glTF?

source: What is the measured value?
it_it: Qual è il valore misurato?

source: What is the range or unit ("mV", "V", "mA", "A")?
it_it: Qual è l'intervallo o l'unità ("mV", "V", "mA", "A")?

source: What makes it so powerful is that the thing being changed can be virtually anything in your system.
it_it: Ciò che lo rende così potente è che l'oggetto da modificare può essere praticamente qualsiasi cosa nel sistema.

source: What might be the problem?
it_it: Quale potrebbe essere il problema?

source: What these are referring to are the two distinct cores present in the Alif E7.
it_it: Questi si riferiscono ai due core distinti presenti nell'Alif E7.

source: What they mean (from ``lv_color.h``):
it_it: Cosa significano (da ``lv_color.h``):

source: What's Next?
it_it: Prossimi Passi

source: When **Helium** and **ACI (Arm Custom Instruction)** are available, it is recommend to use **Synchronous Mode** to accelerate LVGL.
it_it: Quando sono disponibili **Helium** e **ACI (Arm Custom Instruction)**, si consiglia di utilizzare la **Modalità Sincrona** per accelerare LVGL.

source: When :cpp:expr:`lv_obj_set_parent(widget, new_parent)` is used, ``widget`` will become the foremost child of ``new_parent``.
it_it: Quando si usa :cpp:expr:`lv_obj_set_parent(widget, new_parent)`, ``widget`` diventerà il figlio principale di ``new_parent``.

source: When :cpp:expr:`lv_translation_set_language("language")` is called, LVGL sends ``LV_EVENT_TRANSLATION_LANGUAGE_CHANGED`` to every widget, allowing you to update text automatically.
it_it: Quando viene chiamata :cpp:expr:`lv_translation_set_language("language")`, LVGL invia ``LV_EVENT_TRANSLATION_LANGUAGE_CHANGED`` a ogni widget, consentendo di aggiornare automaticamente il testo.

source: When :cpp:func:`lv_label_set_text` or :cpp:func:`lv_label_set_array_text` are used, a separate buffer is allocated and this implementation detail is unnoticed.
it_it: Quando si utilizzano :cpp:func:`lv_label_set_text` o :cpp:func:`lv_label_set_array_text`, viene allocato un buffer separato e questo dettaglio di implementazione passa inosservato.

source: When Arm-2D backed 2D-GPUs are available, for example, **DMAC-350 based 2D GPUs**, it is recommend to use **Asynchronous Mode** to accelerate LVGL.
it_it: Quando sono disponibili GPU 2D basate su Arm-2D, ad esempio **GPU 2D basate su DMAC-350**, si consiglia di utilizzare la **Modalità Asincrona** per accelerare LVGL.

source: When C code is exported from LVGL's UI Editor, no XML is needed at all (``LV_USE_XML`` can be ``0``), and it's very similar to the case when the C code is written by hand.
it_it: Quando il codice C viene esportato dall'Editor dell'interfaccia utente di LVGL, non è necessario alcun codice XML (``LV_USE_XML`` può essere ``0``), ed è molto simile al caso in cui il codice C viene scritto a mano.

source: When LVGL is installed, follow these configuration steps:
it_it: Una volta installato LVGL, seguire questi passaggi di configurazione:

source: When LVGL runs in MicroPython, all dynamic memory allocations (:cpp:func:`lv_malloc`) are handled by MicroPython's memory manager which is `garbage-collected <https://en.wikipedia.org/wiki/Garbage_collection_(computer_science)>`__ (GC).
it_it: Quando LVGL viene eseguito in MicroPython, tutte le allocazioni di memoria dinamica (:cpp:func:`lv_malloc`) vengono gestite dal gestore di memoria di MicroPython, che è `garbage-collected <https://it.wikipedia.org/wiki/Garbage_collection)>`__ (GC).

source: When No Timers Are Ready
it_it: Quando Nessun Timer è Pronto

source: When PV increases, PR is conventionally reset to "r0".
it_it: Quando il PV aumenta, il PR viene convenzionalmente reimpostato a "r0".

source: When `LV_WAYLAND_USE_DMABUF` is set to `1`, the following protocols must also be generated:
it_it: Quando `LV_WAYLAND_USE_DMABUF` è impostato a `1`, devono essere generati anche i seguenti protocolli:

source: When ``..._style_bitmap_mask`` is used, LVGL automatically creates a layer, renders the Widgets there, and applies the bitmap mask during blending.
it_it: Quando si utilizza ``..._style_bitmap_mask``, LVGL crea automaticamente un layer, esegue il rendering dei Widget al suo interno e applica la maschera bitmap durante il blending.

source: When ``LV_BUILD_SET_CONFIG_OPTS`` or ``LV_BUILD_USE_KCONFIG`` are enabled, the options/variables beginning with the prefix ``CONFIG_*`` are automatically set to the values found in ``lv_conf.h``
it_it: Se ``LV_BUILD_SET_CONFIG_OPTS`` o ``LV_BUILD_USE_KCONFIG`` sono abilitati, le opzioni/variabili che iniziano con il prefisso ``CONFIG_*`` vengono automaticamente impostate sui valori presenti in ``lv_conf.h``

source: When ``LV_LINUX_DRM_USE_EGL`` is enabled, the DRM driver will automatically initialize EGL.
it_it: Quando ``LV_LINUX_DRM_USE_EGL`` è abilitato, il driver DRM inizializzerà automaticamente EGL.

source: When ``LV_LINUX_DRM_USE_EGL`` is enabled, the DRM driver will automatically set up EGL.
it_it: Quando ``LV_LINUX_DRM_USE_EGL`` è abilitato, il driver DRM configurerà automaticamente EGL.

source: When ``LV_USE_DRAW_G2D`` is enabled, the Wayland driver will automatically use the G2D backend instead of the default SHM backend.
it_it: Quando ``LV_USE_DRAW_G2D`` è abilitato, il driver Wayland utilizzerà automaticamente il backend G2D al posto del backend SHM di default.

source: When ``header.cf`` is one of the ``RAW`` formats, this can also contain the contents of a file loaded into RAM at run-time, or embedded in ROM (program space).
it_it: Quando ``header.cf`` è uno dei formati ``RAW``, può contenere anche il contenuto di un file caricato nella RAM in fase di esecuzione o incorporato nella ROM (spazio di programma).

source: When a Component is created, it can extend another Component or Widget like ``<view extends="lv_slider">``.
it_it: Quando un Componente viene creato, può estendere un altro Componente o Widget, ad esempio ``<view extends="lv_slider">``.

source: When a Component is used in another Component's XML code and the code is exported, this ``create`` function will be called.
it_it: Quando un Componente viene utilizzato nel codice XML di un altro Componente e il codice viene esportato, verrà chiamata questa funzione ``create``.

source: When a Scale Widget is created, it starts out in MODE :cpp:enumerator:`LV_SCALE_MODE_HORIZONTAL_BOTTOM`.
it_it: Quando viene creato un Widget "Scale", inizia in MODALITÀ :cpp:enumerator:`LV_SCALE_MODE_HORIZONTAL_BOTTOM`.

source: When a Timer is created, its repeat-count is set to ``-1`` to cause it to repeat indefinitely.
it_it: Quando viene creato un Timer, il suo conteggio ripetizioni viene impostato su ``-1`` per farlo ripetere all'infinito

source: When a Widget is created, a pointer to its parent is passed to the create function.
it_it: Quando viene creato un Widget, un puntatore al suo elemento padre viene passato alla funzione "create".

source: When a Widget is created, its reference can be stored in an :cpp:expr:`lv_obj_t *` pointer variable.
it_it: Quando si crea un Widget, il suo riferimento può essere memorizzato in una variabile puntatore :cpp:expr:`lv_obj_t *`.

source: When a Widget is referenced in a Component's or Screen's XML, the XML parser will be called to map the properties to C function calls.
it_it: Quando un Widget viene referenziato nell'XML di un Componente o di uno Screen, il parser XML verrà chiamato per mappare le proprietà alle chiamate di funzione C.

source: When a ``<play_timeline_event>`` is added to a UI element, the target and timeline names are saved as strings.
it_it: Quando un ``<play_timeline_event>`` viene aggiunto a un elemento dell'interfaccia utente, i nomi del target e della timeline vengono salvati come stringhe.

source: When a chart is drawn, certain things appear on top of other things, in this order, from back to front:
it_it: Quando si disegna un grafico, alcuni elementi appaiono sopra altri, in questo ordine, dal basso verso l'alto:

source: When a component's XML is converted to C files, only a ``create`` function is generated, where all the ``<prop>``\s are arguments.
it_it: Quando l'XML di un componente viene convertito in file C, viene generata solo una funzione ``create``, in cui tutti i ``<prop>`` sono argomenti.

source: When a data series is created, it comes with pre-allocated values array(s) based on its chart type and ``point_count``.
it_it: Quando viene creata una serie di dati, questa viene fornita con array di valori pre-allocati in base al tipo di grafico e al ``point_count``.

source: When a draw buffer is used, it must be already initialized by the user with :cpp:enumerator:`LV_COLOR_FORMAT_ARGB8888_PREMULTIPLIED` color format.
it_it: Quando si utilizza un buffer di disegno, questo deve essere già inizializzato dall'utente con il formato colore :cpp:enumerator:`LV_COLOR_FORMAT_ARGB8888_PREMULTIPLIED`.

source: When a function writes to the address contained by a pointer parameter, if not already obvious (e.g. when the parameter name contains the word "out"), include the direction in the command for clarity:
it_it: Quando una funzione scrive all'indirizzo contenuto da un parametro puntatore, se non è già ovvio (ad esempio, quando il nome del parametro contiene la parola "out"), includere la direzione nel comando per chiarezza:

source: When a gradient is created, it can be referenced by its name, like:
it_it: Quando si crea un gradiente, è possibile farvi riferimento tramite il suo nome, ad esempio:

source: When a new version of the container is published (e.g. with updated toolchains, build logic, etc.), the Editor automatically checks for and pulls the latest version.
it_it: Quando viene pubblicata una nuova versione del container (ad esempio con toolchain aggiornate, logica di compilazione, ecc.), l'editor ne verifica automaticamente la presenza e scarica la versione più recente.

source: When a recipe is compiled, it will run multiple tasks.
it_it: Quando una ricetta viene compilata, eseguirà più task.

source: When a widget receives focus either by clicking it via touchpad or by navigating to it with an encoder or keypad, it enters the :cpp:enumerator:`LV_STATE_FOCUSED` state.
it_it: Quando un widget riceve il focus cliccandoci sopra tramite touchpad o navigandoci sopra con un encoder o una tastiera, entra nello stato :cpp:enumerator:`LV_STATE_FOCUSED`.

source: When activated (by click on the Drop-Down List), a list is created from which the user may select one item.
it_it: Quando viene attivata (cliccando sulla Drop-Down List), viene creato un elenco da cui l'utente può selezionare un elemento.

source: When adding a data series to a SCATTER chart, bit-wise OR your selected Y axis (primary or secondary) with one of the X-axis values.
it_it: Quando si aggiunge una serie di dati a un grafico a dispersione, è possibile utilizzare l'opzione "bit per bit" OPPURE l'asse Y selezionato (primario o secondario) con uno dei valori dell'asse X.

source: When adding or modifying comments, priorities are (in order of importance):
it_it: Quando si aggiungono o modificano commenti, le priorità sono (in ordine di importanza):

source: When adding or removing multiple flags, you have two options:
it_it: Quando si aggiungono o si rimuovono più flag, si hanno due opzioni:

source: When an Observer and its associated events are no longer needed, you can remove it from memory using any of the methods below, depending on the effect you want to create:
it_it: Quando un Observer e gli eventi associati non sono più necessari, è possibile rimuoverli dalla memoria utilizzando uno dei metodi seguenti, a seconda dell'effetto desiderato:
